In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv('cars.csv')

In [3]:
df

        brand  km_driven    fuel                 owner  selling_price
0      Maruti     145500  Diesel           First Owner         450000
1       Skoda     120000  Diesel          Second Owner         370000
2       Honda     140000  Petrol           Third Owner         158000
3     Hyundai     127000  Diesel           First Owner         225000
4      Maruti     120000  Petrol           First Owner         130000
...       ...        ...     ...                   ...            ...
8123  Hyundai     110000  Petrol           First Owner         320000
8124  Hyundai     119000  Diesel  Fourth & Above Owner         135000
8125   Maruti     120000  Diesel           First Owner         382000
8126     Tata      25000  Diesel           First Owner         290000
8127     Tata      25000  Diesel           First Owner         290000

[8128 rows x 5 columns]

In [4]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [5]:
df['brand'].nunique()

32

In [13]:
X= df.iloc[:,0:4]
Y = df.iloc[:,-1]

In [15]:
from sklearn.model_selection import train_test_split

In [16]:
x_train,x_test,y_train,y_test=train_test_split(X,Y,test_size=0.2)

In [17]:
x_train.shape,x_test.shape

((6502, 4), (1626, 4))

In [18]:
from sklearn.preprocessing import OneHotEncoder

In [19]:
hot = OneHotEncoder()

In [21]:
xtr = hot.fit_transform(x_train[['fuel','owner']]).toarray()
xte = hot.fit_transform(x_test[['fuel','owner']]).toarray()

In [31]:
xtr.shape

(6502, 9)

In [33]:
x_train.shape

(6502, 4)

In [38]:
data = np.hstack((x_train[['brand','km_driven']].values,xtr))

In [39]:
data = pd.DataFrame(data)

In [40]:
data

            0       1    2    3    4    5    6    7    8    9    10
0     Mahindra   78500  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0
1       Maruti  100000  0.0  0.0  0.0  1.0  0.0  0.0  1.0  0.0  0.0
2     Mahindra  120000  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0
3         Ford  120000  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0
4         Tata   15000  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0
...        ...     ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
6497     Honda   48228  0.0  0.0  0.0  1.0  1.0  0.0  0.0  0.0  0.0
6498   Hyundai   70000  0.0  1.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0
6499      Jeep   17000  0.0  0.0  0.0  1.0  1.0  0.0  0.0  0.0  0.0
6500    Jaguar    9000  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0
6501   Hyundai  105000  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0

[6502 rows x 11 columns]